# read design
read_verilog selector4.v
hierarchy -check -top selector4

#the hight-level stuff
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library
techmap; opt

#mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#Show diagram tengo que quitarle ese show para que corra
#show selector4

#cleanup
clean

#write synthesized desgin
write_verilog synth_selector4.v
