read_verilog selector4.v

hierarchy -check -top selector4

proc; fsm; opt; memory; opt;  

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

show selector4

write_verilog synth_selector4.v
